In [1]:
import pandas as pd
import numpy as np

In [2]:
my_data = np.array([[10,20,30],[20,30,40],[20,50,10],[10,15,50]])

In [3]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 50]])

In [4]:
my_rows = ["Con","Sam","Coni","Toni"]

In [5]:
my_columns = ["Jan","Feb","Mar"]

In [6]:
my_data_frame = pd.DataFrame(my_data)

In [7]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  50

In [8]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [9]:
my_data_frame[1]

0    20
1    30
2    50
3    15
Name: 1, dtype: int64

In [10]:
new_data_frame = pd.DataFrame(my_data, index=my_rows, columns=my_columns)

In [11]:
new_data_frame

      Jan  Feb  Mar
Con    10   20   30
Sam    20   30   40
Coni   20   50   10
Toni   10   15   50

In [12]:
new_data_frame["Feb"]

Con     20
Sam     30
Coni    50
Toni    15
Name: Feb, dtype: int64

In [13]:
type(new_data_frame["Feb"])

pandas.core.series.Series

In [14]:
feb_series = new_data_frame["Feb"]

In [15]:
feb_series.mean()

28.75

In [16]:
feb_series.Con

20

In [17]:
feb_series.max()

50

In [18]:
new_data_frame

      Jan  Feb  Mar
Con    10   20   30
Sam    20   30   40
Coni   20   50   10
Toni   10   15   50

In [19]:
new_data_frame[["Jan","Feb"]]

      Jan  Feb
Con    10   20
Sam    20   30
Coni   20   50
Toni   10   15

In [20]:
new_data_frame.loc["Con"]

Jan    10
Feb    20
Mar    30
Name: Con, dtype: int64

In [21]:
type(new_data_frame.loc["Con"])

pandas.core.series.Series

In [22]:
new_data_frame.loc["Sam"].mean()

30.0

In [23]:
new_data_frame

      Jan  Feb  Mar
Con    10   20   30
Sam    20   30   40
Coni   20   50   10
Toni   10   15   50

In [24]:
new_data_frame.iloc[3]

Jan    10
Feb    15
Mar    50
Name: Toni, dtype: int64

In [25]:
new_data_frame["Apr"] = new_data_frame["Mar"] * 2

In [26]:
new_data_frame

      Jan  Feb  Mar  Apr
Con    10   20   30   60
Sam    20   30   40   80
Coni   20   50   10   20
Toni   10   15   50  100

In [27]:
new_data_frame.drop("Toni",axis=0) #axis[0] row

      Jan  Feb  Mar  Apr
Con    10   20   30   60
Sam    20   30   40   80
Coni   20   50   10   20

In [28]:
new_data_frame

      Jan  Feb  Mar  Apr
Con    10   20   30   60
Sam    20   30   40   80
Coni   20   50   10   20
Toni   10   15   50  100

In [29]:
new_data_frame.drop("Jan",axis=1)

      Feb  Mar  Apr
Con    20   30   60
Sam    30   40   80
Coni   50   10   20
Toni   15   50  100

In [30]:
new_data_frame

      Jan  Feb  Mar  Apr
Con    10   20   30   60
Sam    20   30   40   80
Coni   20   50   10   20
Toni   10   15   50  100

In [31]:
new_data_frame.drop("Apr",axis=1,inplace=True)

In [32]:
new_data_frame

      Jan  Feb  Mar
Con    10   20   30
Sam    20   30   40
Coni   20   50   10
Toni   10   15   50

In [33]:
new_data_frame["Jan"]["Sam"]

20

In [34]:
boolen_frame = new_data_frame > 25

In [35]:
boolen_frame

        Jan    Feb    Mar
Con   False  False   True
Sam   False   True   True
Coni  False   True  False
Toni  False  False   True

In [36]:
new_data_frame[boolen_frame]

      Jan   Feb   Mar
Con   NaN   NaN  30.0
Sam   NaN  30.0  40.0
Coni  NaN  50.0   NaN
Toni  NaN   NaN  50.0

In [37]:
new_data_frame[new_data_frame > 25]

      Jan   Feb   Mar
Con   NaN   NaN  30.0
Sam   NaN  30.0  40.0
Coni  NaN  50.0   NaN
Toni  NaN   NaN  50.0

In [38]:
new_data_frame[new_data_frame["Mar"] > 25]

      Jan  Feb  Mar
Con    10   20   30
Sam    20   30   40
Toni   10   15   50

In [40]:
new_data_frame.reset_index()

  index  Jan  Feb  Mar
0   Con   10   20   30
1   Sam   20   30   40
2  Coni   20   50   10
3  Toni   10   15   50

In [41]:
new_data_frame["NewIndex"] = ["Hans","Sam","Toni","Coni"]

In [42]:
new_data_frame.set_index("NewIndex")

          Jan  Feb  Mar
NewIndex
Hans       10   20   30
Sam        20   30   40
Toni       20   50   10
Coni       10   15   50

In [43]:
new_data_frame

      Jan  Feb  Mar NewIndex
Con    10   20   30     Hans
Sam    20   30   40      Sam
Coni   20   50   10     Toni
Toni   10   15   50     Coni

In [44]:
new_data_frame.drop("NewIndex",axis=1,inplace=True)

In [45]:
new_data_frame

      Jan  Feb  Mar
Con    10   20   30
Sam    20   30   40
Coni   20   50   10
Toni   10   15   50